Revit 2027 API
BuiltInFailures.CopyPasteFailures.CannotCopyNoAttachedParent Property
 Attached Detail Group can't be copied without its Model Group
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotCopyNoAttachedParent { get; }
Public Shared ReadOnly Property CannotCopyNoAttachedParent As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotCopyNoAttachedParent {
	FailureDefinitionId^ get ();
}
static member CannotCopyNoAttachedParent : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CopyPasteFailures Class
Autodesk.Revit.DB Namespace